{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "string",
      "metadata": {
        "description": "Log Analytics Workspace Name"
      }
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/AADSignInParser')]",
      "properties": {
        "displayName": "AADSignInParser",
        "category": "Parsers",
        "functionAlias": "AADSignInParser",
        "query": "SigninLogs | summarize arg_max(TimeGenerated, *) by UserPrincipalName | project TimeGenerated, UserPrincipalName, AppDisplayName, IPAddress, Location, ResultType, ResultDescription, ConditionalAccessStatus",
        "version": 1
      }
    }
  ]
}
