let AADSignInParser = () {
SigninLogs
| summarize arg_max(TimeGenerated, *) by UserPrincipalName
| project TimeGenerated,
          UserPrincipalName,
          AppDisplayName,
          IPAddress,
          Location,
          ResultType,
          ResultDescription,
          ConditionalAccessStatus
};
AADSignInParser
